revk/ESP32-Audio/components/ESP32-RevK/lwmqtt.c
// Light weight MQTT client
// QoS 0 only, no queuing or resending (using TCP to do that for us)
// Live sending to TCP for outgoing messages
// Simple callback for incoming messages
// Automatic reconnect
static const char __attribute__((unused)) * TAG = "LWMQTT";

#include "revk.h"
#include <stdio.h>
#include <stdint.h>
#include <stddef.h>
#include <string.h>
#include <unistd.h>
#include <time.h>
#include "esp_wifi.h"
#include "esp_system.h"
#include "nvs_flash.h"
#include "esp_event.h"
#include "esp_timer.h"
#include "esp_log.h"
#include "esp_tls.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"

#include "lwip/sockets.h"
#include "lwip/dns.h"
#include "lwip/netdb.h"

#include "esp_tls.h"
#ifdef  CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
#include "esp_crt_bundle.h"
#endif

#include "esp8266_tls_compat.h"

#ifdef	CONFIG_REVK_MQTT_SERVER
#warning MQTT server code is not complete
#endif

struct lwmqtt_s
{                               // mallocd copies
   lwmqtt_callback_t *callback;
   void *arg;
   char *hostname;
   char *tlsname;
   unsigned short port;
   unsigned short connectlen;
   unsigned char *connect;
   SemaphoreHandle_t mutex;     // atomic send mutex
   esp_tls_t *tls;              // Connection handle
   int sock;                    // Connection socket
   unsigned short keepalive;
   unsigned short seq;
   uint32_t connecttime;        // Time of connect
   uint8_t backoff:4;           // Reconnect backoff
   uint8_t running:1;           // Should still run
   uint8_t server:1;            // This is a server
   uint8_t connected:1;         // Login sent/received
   uint8_t failed:3;            // Login received error
   uint8_t hostname_ref;        // The buf below is not malloc'd
   uint8_t tlsname_ref;         // The buf below is not malloc'd
   uint8_t ca_cert_ref:1;       // The _buf below is not malloc'd
   uint8_t our_cert_ref:1;      // The _buf below is not malloc'd
   uint8_t our_key_ref:1;       // The _buf below is not malloc'd
   void *ca_cert_buf;           // For checking server
   int ca_cert_bytes;
   void *our_cert_buf;          // For auth
   int our_cert_bytes;
   void *our_key_buf;           // For auth
   int our_key_bytes;
     esp_err_t (*crt_bundle_attach) (void *conf);
};

#define	hread(handle,buf,len)	(handle->tls?esp_tls_conn_read(handle->tls,buf,len):read(handle->sock,buf,len))

static int
hwrite (lwmqtt_t handle, uint8_t * buf, int len)
{                               // Send (all of) a block
   int pos = 0;
   while (pos < len)
   {
      int sent =
         (handle->tls ? esp_tls_conn_write (handle->tls, buf + pos, len - pos) : write (handle->sock, buf + pos, len - pos));
      if (sent <= 0)
         return sent;
      pos += sent;
   }
   return pos;
}

static void *
handle_free (lwmqtt_t handle)
{
   if (handle)
   {
      freez (handle->connect);
      if (!handle->hostname_ref)
         freez (handle->hostname);
      if (!handle->tlsname_ref)
         freez (handle->tlsname);
      if (!handle->ca_cert_ref)
         freez (handle->ca_cert_buf);
      if (!handle->our_cert_ref)
         freez (handle->our_cert_buf);
      if (!handle->our_key_ref)
         freez (handle->our_key_buf);
      if (handle->mutex)
         vSemaphoreDelete (handle->mutex);
      freez (handle);
   }
   return NULL;
}

void
handle_close (lwmqtt_t handle)
{
   esp_tls_t *tls = handle->tls;
   int sock = handle->sock;
   handle->tls = NULL;
   handle->sock = -1;
   if (tls)
   {                            // TLS
      if (handle->server)
      {
#ifdef CONFIG_ESP_TLS_SERVER
         esp_tls_server_session_delete (tls);
#endif
         close (sock);
      } else
         esp_tls_conn_destroy (tls);
   } else if (sock >= 0)
      close (sock);
   usleep (100000);
}

static int
handle_certs (lwmqtt_t h, uint8_t ca_cert_ref, int ca_cert_bytes, void *ca_cert_buf, uint8_t our_cert_ref, int our_cert_bytes,
              void *our_cert_buf, uint8_t our_key_ref, int our_key_bytes, void *our_key_buf)
{
   int fail = 0;
   if (ca_cert_bytes && ca_cert_buf)
   {
      h->ca_cert_bytes = ca_cert_bytes;
      if ((h->ca_cert_ref = ca_cert_ref))
         h->ca_cert_buf = ca_cert_buf;  // No malloc as reference will stay valid
      else if (!(h->ca_cert_buf = mallocspi (ca_cert_bytes)))
         fail++;                // malloc failed
      else
         memcpy (h->ca_cert_buf, ca_cert_buf, ca_cert_bytes);
   }
   if (our_cert_bytes && our_cert_buf)
   {
      h->our_cert_bytes = our_cert_bytes;
      if ((h->our_cert_ref = our_cert_ref))
         h->our_cert_buf = our_cert_buf;        // No malloc as reference will stay valid
      else if (!(h->our_cert_buf = mallocspi (our_cert_bytes)))
         fail++;                // malloc failed
      else
         memcpy (h->our_cert_buf, our_cert_buf, our_cert_bytes);
   }
   if (our_key_bytes && our_key_buf)
   {
      h->our_key_bytes = our_key_bytes;
      if ((h->our_key_ref = our_cert_ref))
         h->our_key_buf = our_key_buf;  // No malloc as reference will stay valid
      else if (!(h->our_key_buf = mallocspi (our_key_bytes)))
         fail++;                // malloc failed
      else
         memcpy (h->our_key_buf, our_key_buf, our_key_bytes);
   }
   return fail;
}

static void client_task (void *pvParameters);
#ifdef  CONFIG_REVK_MQTT_SERVER
static void listen_task (void *pvParameters);
#endif

// Create a connection
lwmqtt_t
lwmqtt_client (lwmqtt_client_config_t * config)
{
   if (!config || !config->hostname)
      return NULL;
   lwmqtt_t handle = mallocspi (sizeof (*handle));
   if (!handle)
      return handle_free (handle);
   memset (handle, 0, sizeof (*handle));
   handle->sock = -1;
   handle->callback = config->callback;
   handle->arg = config->arg;
   handle->keepalive = config->keepalive ? : 60;
   if ((handle->hostname_ref = config->hostname_ref))
      handle->hostname = (void *) config->hostname;
   else if (!(handle->hostname = strdup (config->hostname)))
      return handle_free (handle);
   handle->port = (config->port ? : (config->ca_cert_bytes || config->crt_bundle_attach) ? 8883 : 1883);
   if ((handle->tlsname_ref = config->tlsname_ref))
      handle->tlsname = (void *) config->tlsname;
   else if (config->tlsname && *config->tlsname && !(handle->tlsname = strdup (config->tlsname)))
      return handle_free (handle);
   // Make connection message
   int mlen = 6 + 1 + 1 + 2 + strlen (config->client ? : "");
   if (config->plen < 0)
      config->plen = strlen ((char *) config->payload ? : "");
   if (config->topic)
      mlen += 2 + strlen (config->topic) + 2 + config->plen;
   if (config->username)
   {
      mlen += 2 + strlen (config->username);
      if (config->password)
         mlen += 2 + strlen (config->password);
   }
   if (handle_certs
       (handle, config->ca_cert_ref, config->ca_cert_bytes, config->ca_cert_buf, config->client_cert_ref, config->client_cert_bytes,
        config->client_cert_buf, config->client_key_ref, config->client_key_bytes, config->client_key_buf))
      return handle_free (handle);      // Nope
   handle->crt_bundle_attach = config->crt_bundle_attach;
   if (mlen >= 128 * 128)
      return handle_free (handle);      // Nope
   mlen += 2;                   // keepalive
   if (mlen >= 128)
      mlen++;                   // two byte len
   mlen += 2;                   // header and one byte len
   if (!(handle->connect = mallocspi (mlen)))
      return handle_free (handle);
   unsigned char *p = handle->connect;
   void str (int l, const char *s)
   {
      if (l < 0)
         l = strlen (s ? : "");
      *p++ = l >> 8;
      *p++ = l;
      if (l && s)
         memcpy (p, s, l);
      p += l;
   }
   *p++ = 0x10;                 // connect
   if (mlen > 129)
   {                            // Two byte len
      *p++ = (((mlen - 3) & 0x7F) | 0x80);
      *p++ = ((mlen - 3) >> 7);
   } else
      *p++ = mlen - 2;          // 1 byte len
   str (4, "MQTT");
   *p++ = 4;                    // protocol level
   *p = 0x02;                   // connect flags (clean)
   if (config->username)
   {
      *p |= 0x80;               // Username
      if (config->password)
         *p |= 0x40;            // Password
   }
   if (config->topic)
   {
      *p |= 0x04;               // Will
      if (config->retain)
         *p |= 0x20;            // Will retain
   }
   p++;
   *p++ = handle->keepalive >> 8;       // keep alive
   *p++ = handle->keepalive;
   str (-1, config->client);    // Client ID
   if (config->topic)
   {                            // Will
      str (-1, config->topic);  // Topic
      str (config->plen, (void *) config->payload);     // Payload
   }
   if (config->username)
   {
      str (-1, config->username);
      if (config->password)
         str (-1, config->password);
   }
   assert ((p - handle->connect) == mlen);
   handle->connectlen = mlen;
   handle->mutex = xSemaphoreCreateBinary ();
   xSemaphoreGive (handle->mutex);
   handle->running = 1;
   TaskHandle_t task_id = NULL;
   xTaskCreate (client_task, "mqtt-client", 4 * 1024, (void *) handle, 2, &task_id);
   return handle;
}

#ifdef	CONFIG_REVK_MQTT_SERVER
// Start a server
lwmqtt_t
lwmqtt_server (lwmqtt_server_config_t * config)
{
   if (!config)
      return NULL;
   lwmqtt_t handle = mallocspi (sizeof (*handle));
   if (!handle)
      return handle_free (handle);
   memset (handle, 0, sizeof (*handle));
   handle->callback = config->callback;
   handle->port = (config->port ? : config->ca_cert_bytes ? 8883 : 1883);
   if (handle_certs
       (handle, config->ca_cert_ref, config->ca_cert_bytes, config->ca_cert_buf, config->server_cert_ref, config->server_cert_bytes,
        config->server_cert_buf, config->server_key_ref, config->server_key_bytes, config->server_key_buf))
      return handle_free (handle);
   handle->running = 1;
   TaskHandle_t task_id = NULL;
   xTaskCreate (listen_task, "mqtt-listen", 3 * 1024, (void *) handle, 2, &task_id);
   return handle;
}
#endif

// End connection - actually freed later as part of task. Will do a callback when closed if was connected
// NULLs the passed handle - do not use handle after this call
void
lwmqtt_end (lwmqtt_t * handle)
{
   if (!handle || !*handle)
      return;
   if ((*handle)->running)
   {
      ESP_LOGD (TAG, "Ending");
      (*handle)->running = 0;
   }
   *handle = NULL;
}

// Subscribe (return is non null error message if failed)
const char *
lwmqtt_subscribeub (lwmqtt_t handle, const char *topic, char unsubscribe)
{
   const char *ret = NULL;
   if (!handle)
      ret = "No handle";
   else if (handle->server)
      ret = "We are server";
   else
   {
      int tlen = strlen (topic ? : "");
      int mlen = 2 + 2 + tlen;
      if (!unsubscribe)
         mlen++;                // QoS requested
      if (mlen >= 128 * 128)
         ret = "Too big";
      else
      {
         if (mlen >= 128)
            mlen++;             // two byte len
         mlen += 2;             // header and one byte len
         unsigned char *buf = mallocspi (mlen);
         if (!buf)
            ret = "Malloc";
         else
         {
            if (!xSemaphoreTake (handle->mutex, portMAX_DELAY))
               ret = "Failed to get lock";
            else
            {
               if (handle->sock < 0)
                  ret = "Not connected";
               else
               {
                  unsigned char *p = buf;
                  *p++ = (unsubscribe ? 0xA2 : 0x82);   // subscribe/unsubscribe
                  if (mlen > 129)
                  {             // Two byte len
                     *p++ = (((mlen - 3) & 0x7F) | 0x80);
                     *p++ = ((mlen - 3) >> 7);
                  } else
                     *p++ = mlen - 2;   // 1 byte len
                  if (!++(handle->seq))
                     handle->seq++;     // Non zero
                  *p++ = handle->seq >> 8;
                  *p++ = handle->seq;
                  *p++ = tlen >> 8;
                  *p++ = tlen;
                  if (tlen)
                     memcpy (p, topic, tlen);
                  p += tlen;
                  if (!unsubscribe)
                     *p++ = 0x00;       // QoS requested
                  assert ((p - buf) == mlen);
                  if (hwrite (handle, buf, mlen) < mlen)
                     ret = "Failed to send";
               }
               xSemaphoreGive (handle->mutex);
            }
            freez (buf);
         }
      }
   }
   if (ret)
      ESP_LOGD (TAG, "Sub/unsub: %s", ret);
   return ret;
}

